backend/app/Controllers/BarangController.php

    public function create()
    {
        $rules = $this->validate([
            'id_barang' => 'required',
            'nama_barang' => 'required',
        ]);
        if (!$rules) {
            $response = [
                'message' => $this->validator->getErrors(),
            ];
            return $this->failValidationErrors($response);
        }
        $this->model->insert([
            'id_barang' => esc($this->request->getVar('id_barang')),
            'nama_barang' => esc($this->request->getVar('nama_barang')),
        ]);
---
INSERT INTO `tbl_barang` (`id_barang`, `nama_barang`, `created_at`, `updated_at`) VALUES ('A003', 'Sugar', '2023-06-25 16:19:12', '2023-06-25 16:19:12')

    public function update($id = null)
    {
        $rules = $this->validate([
            'id_barang' => 'required',
            'nama_barang' => 'required',
        ]);
        if (!$rules) {
            $response = [
                'message' => $this->validator->getErrors(),
            ];
            return $this->failValidationErrors($response);
        }
        $this->model->update($id, [
            'id_barang' => esc($this->request->getVar('id_barang')),
            'nama_barang' => esc($this->request->getVar('nama_barang')),
        ]);
---
UPDATE `tbl_barang` SET `id_barang` = 'A001', `nama_barang` = 'Gula', `updated_at` = '2023-06-25 14:16:47'
WHERE `tbl_barang`.`id` IN ('1')